{
  "activation_fn_name": "swish",
  "architectures": [
    "OpenELMForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_openelm.OpenELMConfig",
    "AutoModelForCausalLM": "modeling_openelm.OpenELMForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "ffn_dim_divisor": 256,
  "ffn_multipliers": [
    0.5,
    0.68,
    0.87,
    1.05,
    1.24,
    1.42,
    1.61,
    1.79,
    1.97,
    2.16,
    2.34,
    2.53,
    2.71,
    2.89,
    3.08,
    3.26,
    3.45,
    3.63,
    3.82,
    4.0
  ],
  "ffn_with_glu": true,
  "head_dim": 64,
  "initializer_range": 0.02,
  "max_context_length": 2048,
  "model_dim": 1536,
  "model_type": "openelm",
  "normalization_layer_name": "rms_norm",
  "normalize_qk_projections": true,
  "num_gqa_groups": 4,
  "num_kv_heads": [
    3,
    3,
    3,
    4,
    4,
    4,
    4,
    4,
    4,
    4,
    5,
    5,
    5,
    5,
    5,
    5,
    6,
    6,
    6,
    6
  ],
  "num_query_heads": [
    12,
    12,
    12,
    16,
    16,
    16,
    16,
    16,
    16,
    16,
    20,
    20,
    20,
    20,
    20,
    20,
    24,
    24,
    24,
    24
  ],
  "num_transformer_layers": 20,
  "qkv_multipliers": [
    0.5,
    1.0
  ],
  "rope_freq_constant": 10000,
  "rope_max_length": 4096,
  "share_input_output_layers": true,
  "torch_dtype": "float32",
  "transformers_version": "4.39.3",
  "use_cache": true,
  "vocab_size": 32000
}
